In [35]:
import pandas as pd
import numpy as np

In [36]:
x = np.random.random((4,5))*10

In [37]:
x

array([[2.69515607, 5.56991534, 6.09253277, 8.78673693, 8.52339263],
       [6.81398795, 5.77949884, 6.78977015, 2.11835156, 9.94219023],
       [5.13237231, 0.02523581, 1.74647684, 2.43173549, 0.46395643],
       [1.13847217, 9.51920618, 3.46075666, 0.10762818, 0.32464556]])

In [38]:
x[x<0.5] = 0.0

In [39]:
x

array([[2.69515607, 5.56991534, 6.09253277, 8.78673693, 8.52339263],
       [6.81398795, 5.77949884, 6.78977015, 2.11835156, 9.94219023],
       [5.13237231, 0.        , 1.74647684, 2.43173549, 0.        ],
       [1.13847217, 9.51920618, 3.46075666, 0.        , 0.        ]])

In [40]:
df = pd.DataFrame(x)
df1 = df.copy()

In [41]:
df

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372  0.000000  1.746477  2.431735  0.000000
3  1.138472  9.519206  3.460757  0.000000  0.000000

In [42]:
df.replace(0,np.nan,inplace=True)

In [43]:
df

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372       NaN  1.746477  2.431735       NaN
3  1.138472  9.519206  3.460757       NaN       NaN

In [44]:
df.describe()

              0         1         2         3         4
count  4.000000  3.000000  4.000000  3.000000  2.000000
mean   3.944997  6.956207  4.522384  4.445608  9.232791
std    2.521881  2.222095  2.340877  3.762792  1.003241
min    1.138472  5.569915  1.746477  2.118352  8.523393
25%    2.305985  5.674707  3.032187  2.275044  8.878092
50%    3.913764  5.779499  4.776645  2.431735  9.232791
75%    5.552776  7.649353  6.266842  5.609236  9.587491
max    6.813988  9.519206  6.789770  8.786737  9.942190

In [45]:
df.fillna(df.mean(),inplace=True)

In [46]:
df

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372  6.956207  1.746477  2.431735  9.232791
3  1.138472  9.519206  3.460757  4.445608  9.232791

In [47]:
df1

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372  0.000000  1.746477  2.431735  0.000000
3  1.138472  9.519206  3.460757  0.000000  0.000000

In [48]:
df2 = df1.copy()

In [49]:
df1.replace(0,np.nan,inplace=True)

In [50]:
df1

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372       NaN  1.746477  2.431735       NaN
3  1.138472  9.519206  3.460757       NaN       NaN

In [51]:
df1.fillna(method='ffill',inplace=True)

In [52]:
df1

          0         1         2         3         4
0  2.695156  5.569915  6.092533  8.786737  8.523393
1  6.813988  5.779499  6.789770  2.118352  9.942190
2  5.132372  5.779499  1.746477  2.431735  9.942190
3  1.138472  9.519206  3.460757  2.431735  9.942190